# Week 9 | Exploratory Data Analysis

## Import Packages

In [1]:
import pandas as pd
import numpy as np
from scipy import stats

In [2]:
df = pd.read_csv('heart_failure.csv')

In [3]:
#read first 5 lines
df.head()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,hypertension,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death
0,75.0,No,582,No,20,Yes,265000.00,1.9,130,Male,No,4,Yes
1,55.0,No,7861,No,38,No,263358.03,1.1,136,Male,No,6,Yes
2,65.0,No,146,No,20,No,162000.00,1.3,129,Male,Yes,7,Yes
3,50.0,Yes,111,No,20,No,210000.00,1.9,137,Male,No,7,Yes
4,65.0,Yes,160,Yes,20,No,327000.00,2.7,116,Female,No,8,Yes

#### *Question 1.*

import pandas as pd

#### *Question 2.*

df = pd.read_csv('heart_failure.csv')

#### *Question 3.*

In [4]:
# How do you display the first 5 rows of a DataFrame in pandas?
df.head()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,hypertension,platelets,serum_creatinine,serum_sodium,sex,smoking,time,death
0,75.0,No,582,No,20,Yes,265000.00,1.9,130,Male,No,4,Yes
1,55.0,No,7861,No,38,No,263358.03,1.1,136,Male,No,6,Yes
2,65.0,No,146,No,20,No,162000.00,1.3,129,Male,Yes,7,Yes
3,50.0,Yes,111,No,20,No,210000.00,1.9,137,Male,No,7,Yes
4,65.0,Yes,160,Yes,20,No,327000.00,2.7,116,Female,No,8,Yes

#### *Question 4.*

In [5]:
# How do you calculate the mean of a column named Age in a DataFrame named df?
df['age'].mean()

np.float64(60.83389297658862)

#### *Question 5.*

In [ ]:
#How do you calculate the median of a column named Salary in a DataFrame named df?
df['salary'].median()

#### *Question 6.*

df['Score'].std()

#### *Question 7.*

df.isna().sum()

#### *Question 8.*

df['Age'].corr(df['Salary'])

#### *Question 9.*

df[df['Age'] > 30]

#### *Question 10.*

df['Score'].max() - df['Score'].min()

#### *Question 11.*

df.groupby('Department')['Salary'].mean()

#### *Question 12.*

df.groupby(['Department', 'Job Title']).size()

#### *Question 13.*

df.groupby('Department')['Age'].max()

#### *Question 14.*

pd.crosstab(df['Department'], df['Job Title'])

#### *Question 15.*

pd.crosstab(df['Department'], df['Job Title'], values=df['Salary'], aggfunc='mean')